In [76]:
# - Import Packages
import pandas as pd
import sqlite3 
import plotly

In [77]:
# - Import Data into Database
db = sqlite3.connect("MotorcycleData.db")
df = pd.read_csv('MotorcycleData.csv', encoding='cp1252')
df.to_sql("Sales", db, if_exists="replace")

In [78]:
# - Display Rough Data
def make_query(query): 
    return pd.read_sql_query(query,db)

query = """
SELECT * 
FROM Sales;
"""
make_query(query)

,index,Unnamed: 0,Condition,Condition_Desc,Price,Location,Model_Year,Mileage,Exterior_Color,Make,...,Vehicle_Title,OBO,Feedback_Perc,Watch_Count,N_Reviews,Seller_Status,Vehicle_Tile,Auction,Buy_Now,Bid_Count
0,0,3319,New,None,"$2,750","Chandler, Arizona, United States",1910,0,Black,Indian,...,None,1,9.4,21,185,Private Seller,Clear,0,1,NaN
1,1,3221,New,None,"$3,800","Chandler, Arizona, United States",1911,0,Red,Indian,...,None,1,9.4,27,185,Private Seller,Clear,0,1,NaN
2,2,3616,New,None,"$3,800","Batavia, Illinois, United States",1914,0,Yellow,Custom,...,None,1,100,39,477,Private Seller,Clear,0,1,NaN
3,3,2993,Used,Fully restored 1939 Indian Four #1 Quality Res...,"$60,201","Rollinsford, New Hampshire, United States",1939,0,Black,Indian,...,None,0,100,None,44,Private Seller,Clear,1,0,30.0
4,4,3511,Used,Excellent Restored Condition,"$3,000","Clinton, Missouri, United States",1939,0,Red,Other,...,None,0,100,None,1098,Private Seller,Clear,1,0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7488,7488,4015,Used,EXCELLENT CONDITION. WE SHIP. BUYER RESPONSIBL...,"$1,399","Grapevine, Texas, United States",2017,None,Blue,Yamaha,...,None,1,100,None,39,Dealer,Clear,0,1,NaN
7489,7489,6144,Used,"We are selling a Victory Judge 2013, customize...","$14,500","Levis, Quebec, Canada",2013,None,None,Other,...,None,1,100,15,196,None,None,0,1,NaN
7490,7490,5268,New,None,"$50,000","Saint-Jean-Chrysostome, Quebec, Canada",2018,None,None,Other,...,None,1,None,13,2,None,None,0,1,NaN
7491,7491,6164,Used,None,"$10,000","Mascouche, Quebec, Canada",2017,None,None,Other,...,None,1,100,None,3,None,None,0,1,NaN
7492,7492,6184,Used,None,"$5,995","Terrebonne, Quebec, Canada",2004,None,None,Other,...,None,0,None,4<,0,None,None,0,1,NaN

In [79]:
# - Display Cleaned Data
query = """
SELECT Condition, Price, Model_Year AS "Year", Exterior_Color AS "Color", Make 
FROM Sales;
"""
make_query(query)

     Condition     Price  Year   Color    Make
0          New   $2,750   1910   Black  Indian
1          New   $3,800   1911     Red  Indian
2          New   $3,800   1914  Yellow  Custom
3         Used  $60,201   1939   Black  Indian
4         Used   $3,000   1939     Red   Other
...        ...       ...   ...     ...     ...
7488      Used   $1,399   2017    Blue  Yamaha
7489      Used  $14,500   2013    None   Other
7490       New  $50,000   2018    None   Other
7491      Used  $10,000   2017    None   Other
7492      Used   $5,995   2004    None   Other

[7493 rows x 5 columns]

In [80]:
# - Basic Data Manipulation - Total Sales
query = """
SELECT '$' || SUM(CAST(REPLACE(REPLACE(Price, '$',''), ',','') AS int)) AS "Total Sales"
FROM Sales;
"""
make_query(query)

  Total Sales
0   $74696305

In [81]:
# - Basic Data Manipulation - Average Sale Price
query = """
SELECT '$' || ROUND(AVG(CAST(REPLACE(REPLACE(Price, '$',''), ',','') AS int)), 2) AS "Average Price"
FROM Sales;
"""
make_query(query)

  Average Price
0      $9968.81

In [82]:
# - Basic Data Manipulation - Number of Sales by Make 
query = """
SELECT COUNT(Price), Make 
FROM Sales
GROUP BY Make;
"""
make_query(query)

    COUNT(Price)                     Make
0              1                ADVANTAGE
1              8  American Classic Motors
2             14       American Ironhorse
3             31                  Aprilia
4              5                     BETA
5            405                      BMW
6             11                      BSA
7              3                  Benelli
8              1        Big Bear Choppers
9             29                  Big Dog
10             5                   Bimota
11             4                Boss Hoss
12            12                  Bourget
13            26                    Buell
14             3                  Bultaco
15             1                   CR500R
16            26                 Campagna
17           115                   Can-Am
18            12                  Cushman
19           149                   Custom
20           225                   Ducati
21             1                     Ford
22             1                      GMC
23          2970          Harley-Davidson
24           878                    Honda
25            13                Husqvarna
26             4                  Hyosung
27           183                   Indian
28            64                      KTM
29           514                 Kawasaki
30             1                    Kymco
31            22                MV Agusta
32            36               Moto Guzzi
33             6                   Norton
34           210                    Other
35             2                  Piaggio
36             7                  Polaris
37            13            Royal Enfield
38            17                Slingshot
39           452                   Suzuki
40             1          Swift Motor Co.
41           292                  Triumph
42             1                 Ultimate
43            50                     Ural
44           103                  Victory
45             1                Wild West
46           565                   Yamaha

In [83]:
# - Basic Data Manipulation - Total Sales By Make
query = """
SELECT '$' || SUM(CAST(REPLACE(REPLACE(Price, '$',''), ',','') AS int)) AS "Total Sales by Make", Make
FROM Sales
GROUP BY Make
"""
make_query(query)

   Total Sales by Make                     Make
0               $42500                ADVANTAGE
1               $47460  American Classic Motors
2              $128179       American Ironhorse
3              $222716                  Aprilia
4               $35747                     BETA
5             $4157811                      BMW
6               $36945                      BSA
7               $14265                  Benelli
8               $22970        Big Bear Choppers
9              $384633                  Big Dog
10              $40625                   Bimota
11             $156599                Boss Hoss
12             $153316                  Bourget
13             $119476                    Buell
14              $10849                  Bultaco
15               $7000                   CR500R
16            $1474586                 Campagna
17            $1958867                   Can-Am
18              $42926                  Cushman
19            $1830620                   Custom
20            $2623477                   Ducati
21               $2495                     Ford
22              $14995                      GMC
23           $36030340          Harley-Davidson
24            $5498587                    Honda
25              $42508                Husqvarna
26              $11598                  Hyosung
27            $3307320                   Indian
28             $363043                      KTM
29            $2843765                 Kawasaki
30               $2799                    Kymco
31             $292087                MV Agusta
32             $235469               Moto Guzzi
33             $140900                   Norton
34            $2120122                    Other
35              $11980                  Piaggio
36             $121379                  Polaris
37              $76570            Royal Enfield
38             $395385                Slingshot
39            $2309076                   Suzuki
40                $100          Swift Motor Co.
41            $2560689                  Triumph
42               $7888                 Ultimate
43             $812444                     Ural
44             $931165                  Victory
45               $9950                Wild West
46            $3042084                   Yamaha

In [84]:
# - Basic Data Manipulation - Average Sales By Make
query = """
SELECT '$' || ROUND(AVG(CAST(REPLACE(REPLACE(Price, '$',''), ',','') AS int)), 2) AS "Average Price by Make", Make
FROM Sales
GROUP BY Make
"""
make_query(query)

   Average Price by Make                     Make
0               $42500.0                ADVANTAGE
1                $5932.5  American Classic Motors
2               $9155.64       American Ironhorse
3               $7184.39                  Aprilia
4                $7149.4                     BETA
5               $10266.2                      BMW
6               $3358.64                      BSA
7                $4755.0                  Benelli
8               $22970.0        Big Bear Choppers
9              $13263.21                  Big Dog
10               $8125.0                   Bimota
11             $39149.75                Boss Hoss
12             $12776.33                  Bourget
13              $4595.23                    Buell
14              $3616.33                  Bultaco
15               $7000.0                   CR500R
16             $56714.85                 Campagna
17             $17033.63                   Can-Am
18              $3577.17                  Cushman
19             $12286.04                   Custom
20              $11659.9                   Ducati
21               $2495.0                     Ford
22              $14995.0                      GMC
23             $12131.43          Harley-Davidson
24              $6262.63                    Honda
25              $3269.85                Husqvarna
26               $2899.5                  Hyosung
27             $18072.79                   Indian
28              $5672.55                      KTM
29              $5532.62                 Kawasaki
30               $2799.0                    Kymco
31             $13276.68                MV Agusta
32              $6540.81               Moto Guzzi
33             $23483.33                   Norton
34             $10095.82                    Other
35               $5990.0                  Piaggio
36             $17339.86                  Polaris
37               $5890.0            Royal Enfield
38             $23257.94                Slingshot
39              $5108.58                   Suzuki
40                $100.0          Swift Motor Co.
41              $8769.48                  Triumph
42               $7888.0                 Ultimate
43             $16248.88                     Ural
44              $9040.44                  Victory
45               $9950.0                Wild West
46              $5384.22                   Yamaha

In [85]:
# - Data Manipulation - Finding the Three Best Selling Makes (By Number of Sales)

query = """
SELECT COUNT(Price) AS "Number of Sales", Make 
FROM Sales
GROUP BY Make
ORDER BY COUNT(Price) DESC
LIMIT 3;
"""
make_query(query)

   Number of Sales             Make
0             2970  Harley-Davidson
1              878            Honda
2              565           Yamaha

In [86]:
# - Data Manipulation - Finding the Three Best Selling Makes (By Total Value of Sales)

query = """
SELECT '$' || SUM(CAST(REPLACE(REPLACE(Price, '$',''), ',','') AS int)) AS "Total Sales by Make", Make
FROM Sales
GROUP BY Make
ORDER BY SUM(CAST(REPLACE(REPLACE(Price, '$',''), ',','') AS int)) DESC
LIMIT 3;
"""
make_query(query)

  Total Sales by Make             Make
0           $36030340  Harley-Davidson
1            $5498587            Honda
2            $4157811              BMW

In [87]:
# - Data Manipulation - Finding the Three Highest Individual Sales
query = """
SELECT '$' || CAST(REPLACE(REPLACE(Price, '$',''), ',','') AS int) AS "Sale Price", Make, Model_Year AS "Year", 
Mileage, Exterior_Color AS "COLOR"
FROM Sales
GROUP BY Make
ORDER BY CAST(REPLACE(REPLACE(Price, '$',''), ',','') AS int) DESC
LIMIT 3;
"""
make_query(query)

  Sale Price       Make  Year Mileage  COLOR
0     $53000   Campagna  2016       0  Black
1     $46900  Boss Hoss  2012   2,297   None
2     $42500  ADVANTAGE  1999     700   Blue

In [88]:
# - Data Manipulation - Finding the Three Oldest Bikes Sold
query = """
SELECT '$' || CAST(REPLACE(REPLACE(Price, '$',''), ',','') AS int) AS "Sale Price", Make, Model_Year AS "Year"
FROM Sales
ORDER BY Model_Year
LIMIT 3
"""
make_query(query)

  Sale Price    Make  Year
0      $2750  Indian  1910
1      $3800  Indian  1911
2      $3800  Custom  1914

In [89]:
# - Data Manipulation - Finding the Three Most Common Colors of Bike Sold
query = """
SELECT COUNT(Exterior_Color) AS "Number of Bikes Sold", Exterior_Color AS "Color"
FROM Sales
GROUP BY Exterior_Color
ORDER BY COUNT(Exterior_Color) DESC
LIMIT 3
"""
make_query(query)

   Number of Bikes Sold  Color
0                  1833  Black
1                   836    Red
2                   617   Blue

In [96]:
# - Data Manipulation - Finding the Most Popular Model for each Make
query = """
SELECT Make, Model AS "Most Popular Model", COUNT(Model) AS "Number of Bikes Sold"
FROM Sales
GROUP BY Make
"""
make_query(query)

,Make,Most Popular Model,Number of Bikes Sold
0,ADVANTAGE,32 Victory,1
1,American Classic Motors,Rupp Roaster II,7
2,American Ironhorse,SLAMMER,14
3,Aprilia,"NEW 2016 APRILIA CAPONORD RALLY ABS, WE SHIP!!",29
4,BETA,300RR,4
5,BMW,R-Series,405
6,BSA,Lightning,9
7,Benelli,TNT 600,3
8,Big Bear Choppers,GTX-F LTD 1,1
9,Big Dog,K-9 124 Level 3 Graphics BIG DOG IS BACK,26
10,Bimota,SB6R,5
11,Boss Hoss,Trike,3
12,Bourget,Chopper,9
13,Buell,EBR 1190RX,26
14,Bultaco,Trials,3
15,CR500R,None,0
16,Campagna,T-Rex,26
17,Can-Am,Commander™ X 1000,112
18,Cushman,Airborne,10
19,Custom,Cyclone Board Track Racer,148
20,Ducati,Cadet 100,225
21,Ford,F-150,1
22,GMC,Jimmy,1
23,Harley-Davidson,Sportster,2970
24,Honda,CL,878
25,Husqvarna,TC 85,13
26,Hyosung,ST7,4
27,Indian,None,181
28,KTM,EXC,64
29,Kawasaki,Kawasaki,514
30,Kymco,DOWNTOWN 300i,1
31,MV Agusta,RIVALE 800 EAS,22
32,Moto Guzzi,Nouvo Falcone,34
33,Norton,Commando 850,5
34,Other,Mead Ranger,180
35,Piaggio,946 Bellissima 150 3V,2
36,Polaris,Slingshot SLR Orange Madness,7
37,Royal Enfield,Classic Chrome Export,13
38,Slingshot,Slingshot SL,17
39,Suzuki,RM,452
40,Swift Motor Co.,Bar Chopper,1
41,Triumph,Bonneville,292
42,Ultimate,Rigid,1
43,Ural,IMZ,50
44,Victory,Cross Country Tour,99
45,Wild West,Gunslinger,1
46,Yamaha,DT1MX 250,565